<template><div><h1 id="「あつまれ-どうぶつの森」で学ぶプランニングについて" tabindex="-1"><a class="header-anchor" href="#「あつまれ-どうぶつの森」で学ぶプランニングについて" aria-hidden="true">#</a> 「あつまれ どうぶつの森」で学ぶプランニングについて</h1>
<p>「<a href="https://amzn.to/2zd8PlQ" target="_blank" rel="noopener noreferrer">あつまれ　どうぶつの森<ExternalLinkIcon/></a>」というゲームをプレイしているのですが、</p>
<p>スクラムやアジャイルの手法で使われているプランニングの参考になると感じました。</p>
<h2 id="作業の明確さと報酬" tabindex="-1"><a class="header-anchor" href="#作業の明確さと報酬" aria-hidden="true">#</a> 作業の明確さと報酬</h2>
<p>ゲーム内では、虫取り、魚釣り、花に水をあげるなどのアクションが明確になっています。</p>
<p>その上で、虫取りを5回したら100ポイント得られるなどの報酬も明確になっています。</p>
<p>この他にも明確さと報酬を与える仕組みがたくさんあります。</p>
<p>さらにそのポイントを使うことで家を大きくできたり、家具や衣服を揃えることもできます。</p>
<p>作業が明確だとやらずにはいられなくなります。</p>
<p>また、クッキークリッカーの大ヒットなどを鑑みても</p>
<p>数値が溜まっていくのを眺めるだけでも人は喜びを感じます。</p>
<p>これらが病みつきになる楽しさを生んでいます。</p>
<h2 id="プランニングはあつもりを目指そう" tabindex="-1"><a class="header-anchor" href="#プランニングはあつもりを目指そう" aria-hidden="true">#</a> プランニングはあつもりを目指そう</h2>
<p>「あつまれ　どうぶつの森」と同じように作業と報酬が明確化されていれば、</p>
<p>どんな作業であっても病みつきになるはずです。</p>
<p>この仕組みを作る行為がスクラムやアジャイルでいうところのプランニングと呼ばれる行為にあたります。</p>
<p>きちんとプランニングされていれば、作業はとても中毒性の高いものになります。</p>
<p>もし、きちんと作業と報酬を明確化しているのに、（していると思っているのに）</p>
<p>病みつきなっていないのであれば、明確さが不十分、もしくは報酬が魅力的ではないのかもしれません。</p>
</div></template>


